tests/performance/scenarios/test-histovec-v1-otc.yml
config:
  environments:
    development:
      target: "http://nginx-dev"
      phases:
        - duration: 30
          arrivalRate: 2
        - duration: 30
          arrivalRate: 5
        - duration: 30
          arrivalRate: 10
        - duration: 30
          arrivalRate: 20
        - duration: 60
          arrivalRate: 50
        - pause: 5
        - duration: 60
          arrivalRate: 60
        - pause: 5
        - duration: 60
          arrivalRate: 70
        - pause: 10
        - duration: 60
          arrivalRate: 80
        - pause: 10
        - duration: 60
          arrivalRate: 90
        - pause: 10
        - duration: 60
          arrivalRate: 100
        - pause: 10
        - duration: 60
          arrivalRate: 150
        - pause: 10
        - duration: 60
          arrivalRate: 200
      payload:
        path: ids.csv
        fields:
          - idv
scenarios:
  - name: histovec-v1-otc
    flow:
    - post:
        url: /histovec/api/v1/id
        json:
          uuid: 8ebf2ad7-ec0f-f4d5-d974-995e07f199cf
          id: "{{ idv }}"
        capture:
          - json: "$.token"
            as: "token"
          - json: "$.v"
            as: "v"
    - post:
        url: /histovec/api/v1/otc
        json:
          uuid: 8ebf2ad7-ec0f-f4d5-d974-995e07f199cf
          id: "{{ idv }}"
          code: "{{ idv }}"
          key: "eetuDnUDIB7AsbOibYClLxSz2pPWSP2kyj2qWn0REpY="
          token: "{{ token }}"
          otcId: "{{ token }}"
        capture:
          json: "$.ct"
          as: "ct"